app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
      if @book.save
        flash[:notice] = "You have created book successfully."
        redirect_to book_path(@book.id)
      else
        @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "moca"], ["body", "moca"], ["user_id", 1], ["created_at", "2021-04-25 05:00:30.848848"], ["updated_at", "2021-04-25 05:00:30.848848"]]
SELECT "books".* FROM "books"

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]